import { Element } from "react-scroll";
import { FaHtml5 } from "react-icons/fa";
import HTMLStructure from "./HTMLStructure";
import HTMLElementsAndSyntax from "./HTMLElementsAndSyntax";
import HTMLPageLayout from "./HTMLPageLayout";
import HTMLTags from "./HTMLtags";
import WebsiteStructure from "./WebsiteStructure";
import HTMLTextFormatting from "./HTMLTextFormatting";
import HTMLHyperlink from "./HTMLHyperlink";
import HTMLImage from "./HTMLImage";
import HTMLLists from "./HTMLLists";
import HTMLTable from "./HTMLTable";

const IctHeader = () => {
  return (
    <div className="w-full h-auto flex flex-col items-center gap-y-8 p-8 bg-gray-900 overflow-x-hidden">
      <div className="w-20 h-20 text-orange-600">
        <FaHtml5 className="w-full h-full" />
      </div>
      <div className="text-yellow-400 text-2xl">চতুর্থ অধ্যায়</div>
      <div className="text-yellow-500 text-3xl text-center">
        ওয়েব ডিজাইন পরিচিতি এবং HTML
      </div>
      {/* concept of website */}
      <Element name="concept_design">
        <p className="text-white text-lg leading-relaxed text-justify max-w-5xl">
          <span className="text-teal-500 text-2xl">ওয়েব ডিজাইনের ধারণা</span>
          <br />
          <br />
          <strong>ওয়েবপেজ (Webpage) /ওয়েব ডকুমেন্ট</strong>
          <br />
          ইন্টারনেট তথা ওয়েবে তথ্য (লেখা, অডিও, ভিডিও, স্থির ছবি, এনিমেশন
          ইত্যাদি) সংবলিত পেজ রাখা যায়। বর্তমানে সারা বিশ্বে বিভিন্ন ব্যক্তি
          এবং বাণিজ্যিক প্রতিষ্ঠান তাদের তথ্য ওয়েবে পরিবেশন করছে। ওয়েব পেজ হলো
          এক ধরনের ওয়েব ডকুমেন্ট যা ইন্টারনেট ব্যবহারকারীদের দেখার জন্য বিভিন্ন
          দেশের সার্ভারে রাখা হয়। সরাসরি এইচটিএমএল এর মাধ্যমে অথবা অন্য কোন
          টুলস এর মাধ্যমে ওয়েবপেজ তৈরি করে এইচটিএমএল এ কনভার্ট করা যায়।
          ব্রাউজারের মাধ্যমে ওয়েবপেজকে প্রদর্শন করা যায়। এক ওয়েবপেজের সাথে
          অন্য পেজের লিংক তৈরি করা যায়। একটি ওয়েবসাইটের স্বতন্ত্র কোন পেজকে
          ওয়েবপেজ বলা হয়। .pdf (portable document file) যুক্ত ফাইল ওয়েবে বেশি
          ব্যবহৃত হয়।
          <br />
          <br />
          <strong>ওয়েবসাইট (Website)</strong>
          <br />
          একই ডোমেইনের অধীনে একাধিক ওয়েবপেজের সমষ্টিকে ওয়েবসাইট বলা হয়। ধরা
          যাক, Example University নামক www.exampleuniversity.edu ওয়েবসাইটটিতে
          কতগুলো ওয়েবপেজ যেমন— ভর্তি পরীক্ষার সার্কুলার, ভর্তি পরীক্ষার আসন ও
          মান, সাফল্য ও স্বপ্নগাঁথা, সচরাচর প্রশ্ন এবং অন্যান্য বিভিন্ন পেজ
          রয়েছে যেগুলো লিংক দ্বারা পরস্পরের সাথে সংযুক্ত। Ask.com এর
          সংজ্ঞানুসারে ওয়েবসাইট হলো - A website is a collection of related
          webpages and they contain texts, images and other graphics that users
          can view.
          <br />
          <br />
          ওয়েবসাইটে প্রথম ঢুকলে যে পেজটি প্রদর্শিত হয় সেটিকে হোমপেজ বলা হয়।
          ইন্টারনেটে সার্বক্ষণিক যুক্ত সার্ভারে ওয়েবসাইট রাখা হয়। ওয়েবসাইটকে
          যেখানে হোস্ট করা হয় তাকে ওয়েবসার্ভার বলা হয়। মাইক্রোসফটের ওয়েব
          সার্ভার হলো Internet Information Services (IIS)। ইন্টারনেটে
          ওয়েবসাইটটি যে সার্ভারে রাখা হবে তার জন্য একটি নির্দিষ্ট ঠিকানা থাকে।
          এটিকে ইউআরএল (URL - Uniform Resource Locator) বা ওয়েব এ্যাড্রেস বলা
          হয়। সারা বিশ্বে প্রতিদিন হাজার হাজার ওয়েবসাইট তৈরি হচ্ছে। কোনো
          ওয়েবসাইট যে বিষয়ের সে বিষয়ে কেউ সার্চ করলে সার্চ তালিকায় ঐ
          ওয়েবসাইটের লিংক চলে আসার ব্যবস্থা করা যায়। এতে করে কেউ শুধু
          নির্দিষ্ট কোন ওয়েব ঠিকানা ব্যবহার না করেও তার প্রয়োজনীয় কোন বিষয়
          সম্পর্কে জানার জন্য সার্চ করে ঐ বিষয় সম্পর্কিত যে কারো ওয়েবসাইটে
          ঢুকতে পারে। প্রথম ওয়েবসাইট তৈরি হয় ১৯৯১ সালের ৬ই আগস্ট। ইন্টারনেটে
          একটি ওয়েবসাইট খুলতে যা যা করতে হয়:
          <br />
          ১. প্রথমে একটি ডোমেইন নেম রেজিস্ট্রেশন করতে হবে।
          <br />
          ২. ওয়েবপেজগুলো ডিজাইন করতে হবে।
          <br />
          ৩. ওয়েবপেজগুলো সার্ভারে রাখতে হবে।
          <br />
          ৪. ওয়েবসাইটটি আরো বেশি প্রচারমুখী করার জন্য সার্চ ইঞ্জিনে সাবমিশন
          করতে হবে।
          <br />
          <br />
        </p>
      </Element>
      {/* advantages of website */}
      <Element name="website_advantage">
        <p
          className="text-white text-lg leading-relaxed text-justify max-w-5xl"
          id="#website_advantagee"
        >
          <span className="text-teal-500 text-2xl">ওয়েবসাইটের সুবিধা </span>
          <br />
          <br />
          ওয়েবসাইটের বহুবিধ সুবিধা রয়েছে। যেমন-
          <br />
          ১. স্বল্প ব্যয়ে কোন ব্যবসায়িক প্রতিষ্ঠান তাদের ব্যবসায় প্রসারের
          জন্য ওয়েবসাইট প্রকাশ করতে পারে। প্রিন্ট মিডিয়ার চেয়ে অনেক কম খরচে
          আকর্ষণীয় সাইট তৈরি করা যায়।
          <br />
          ২. ওয়েবসাইটে প্রকাশিত তথ্য যে কেউ যে কোনো স্থান থেকে যে কোনো সময়
          দেখতে পারে।
          <br />
          ৩. ওয়েবসাইটে লেখার পাশাপাশি ছবি, গ্রাফিক্স, অডিও, ভিডিও এবং এনিমেশন
          যুক্ত করা যায়।
          <br />
          ৪. ওয়েবসাইটে তাৎক্ষণিক তথ্য প্রকাশ করা যায়।
          <br />
          ৫. ওয়েবসাইট ব্যবহারকারীদের অনেক সময় বাঁচায়।
          <br />
          ৬. ওয়েবসাইট থেকে প্রয়োজনীয় তথ্য ডাউনলোড করা যায়।
          <br />
          ৭. যে কোন তথ্য জানার সবচেয়ে সহজ মাধ্যম হলো ওয়েবসাইট। যে কোন বিষয়
          যেমন কোন স্থানের তাপমাত্রা, রেলের ও প্লেনের সময়সূচি, ভাড়া ইত্যাদি
          জানা যায়।
          <br />
          ৮. কোন প্রোডাক্ট বা কোন বিষয় সম্পর্কে ব্যবহারকারীদের কাছ থেকে মতামত
          জানা যায়।
          <br />
          ৯. ঘরে বসে থেকে কোন বিষয়ে প্রশিক্ষণ নেয়া যায়।
          <br />
          ১০. বিশ্বের নামকরা বড় বড় লাইব্রেরির সাইটে ঢুকে বই পড়া যায়।
          <br />
          ১১. কোন প্রতিষ্ঠানে সরাসরি না গিয়ে তাদের সাইটে ঢুকে ফর্ম ফিলআপ করা
          যায়। এতে করে সময় ও অর্থ বাঁচে।
          <br />
          ১২. ঘরে বসে বাস, ট্রেন, প্লেনের টিকিট কাটা যায়।
          <br />
          ১৩. হসপিটালের বা হোটেলের সাইটে ঢুকে রুম বুকিং দেয়া যায়।
          <br />
          ১৪. সামাজিক বিভিন্ন সাইটের মাধ্যমে সারা বিশ্বের মানুষের সাথে মতবিনিময়
          করা যায় এবং বন্ধুত্ব করা যায়।
          <br />
          ১৫. সচেতনতামূলক বিভিন্ন কার্যক্রম অল্প খরচে করা যায়। এ ছাড়াও আরো
          অনেক কাজ করা যায়।
          <br />
          <br />
          <strong>ওয়েবপেজের উপাদান (Contents of Webpage)</strong>
          <br />
          ওয়েবসাইটে বিভিন্ন ধরনের তথ্য যেমন, টেক্সট বা লেখা, গ্রাফিক্স, অডিও,
          ভিডিও, ডেটাবেজ ফাইল সরাসরি যুক্ত থাকতে পারে অথবা লিংক করা থাকতে পারে।
          এসব বিষয় হলো ওয়েবসাইটের কন্টেন্টস বা উপাদান।
        </p>
      </Element>
      {/* www description */}
      <Element name="WWW">
        <p className="text-white text-lg leading-relaxed text-justify max-w-5xl">
          <span className="text-teal-500">
            ওয়ার্ল্ড ওয়াইড ওয়েব (www-World Wide Web)
          </span>{" "}
          www এর পূর্ণরূপ হলো World Wide Web। ওয়ার্ল্ড ওয়াইড ওয়েবকে সংক্ষেপে
          ওয়েব নামেও অভিহিত করা হয়ে থাকে। www হলো পৃথিবীর বিভিন্ন দেশের
          সার্ভারে রাখা পরস্পর সংযোগযোগ্য ডকুমেন্টের সাধারণ নাম । এসব ডকুমেন্টের
          সাধারণ পরিচিতি হলো ওয়েবপেজ। ওয়েব ব্রাউজার সফটওয়্যারের মাধ্যমে
          ইন্টারনেটে পৃথিবীর বিভিন্ন দেশের সার্ভারে রাখা ওয়েবপেজ পরিদর্শন করা
          যায়। সমস্ত উন্মুক্ত ওয়েবসাইটগুলোকে সমষ্টিগতভাবে World Wide Web বা
          বিশ্বব্যাপী জাল নাম দেয়া হয়েছে। সারা বিশ্বের সমস্ত ওয়েবপেজের
          সংগ্রহকেই ওয়েব বা ওয়ার্ল্ড ওয়াইড ওয়েব (www) বলা হয় । হাইপারটেক্সট
          সিস্টেমগুলোর ধারণাকে কাজে লাগিয়ে ইংরেজ পদার্থবিদ স্যার টিম বার্নার্স
          লি ১৯৮৯ সালের মার্চে একটি প্রস্তাব লিখেন যা পরবর্তীতে ওয়ার্ল্ড ওয়াইড
          ওয়েব এ রূপ লাভ করে । আইপি এ্যাড্রেস (IP Address) ইন্টারনেটে যুক্ত
          প্রতিটি কমপিউটারের একটি ঠিকানা থাকে। এ ঠিকানাকে আইপি এ্যাড্রেস (IP
          Address) বলা হয়। IP Address এর পূর্ণ রূপ হলো Internet Protocol
          Address. প্রতিটি আইপি অ্যাড্রেস ইউনিক হয় এবং আইপি অ্যাড্রেস দিয়েই এক
          সার্ভার আরেক সার্ভারে ডাটা ট্র্যান্সফার করে। IANA (Internet Assigned
          Numbers Authority) সংস্থাটি আইপি এ্যাড্রেস ব্যবস্থাপনা করে থাকে।
          ইন্টারনেট প্রটোকল ভার্সন-4 (IPV4)-এ একটি আইপি এ্যাড্রেস গড়ে উঠে 32-
          বিট ব্যবহার করে। এই বিটগুলোর প্রতি আটটিকে নিয়ে গড়ে ওঠে একটি করে
          অকটেট। সুতরাং, IPV4-এর আইপি এ্যাড্রেসে থাকছে চারটি অকটেট বা 32 বিট ।
          প্রতিটি অকটেট (ডট) দ্বারা পৃথক থাকে। প্রথম দুটি অকটেট নেটওয়ার্ক আইডি
          ও পরের দুটি অকটেট হোস্ট আইডি প্রকাশ করে। একটি আইপি এ্যাড্রেস তিনভাবে
          প্রকাশ করা যেতে পারে : ডটেড ডেসিম্যাল - 203.91.139.2 বাইনারি-
          110010111011011.10001011.10 হেক্সাডেসিম্যাল CB: 5B : 8B: 2 এভাবে আইপি
          এ্যাড্রেসের জন্য সংখ্যা মনে রাখা কষ্টকর। তাই মনে রাখার জন্য ডোমেইন নেম
          ব্যবহার করা হয়। আইপি এ্যাড্রেসকে শহরের কোন বাড়ির ঠিকানার সাথে তুলনা
          করা চলে। যেমন- কোন এলাকার রাস্তার নাম্বার এবং বাড়ির নাম্বার থাকে।
          একটি বাসায় যত বাড়ি থাকে তাদের মধ্যে কোনো দুটি বাড়ির নাম্বার কখনো এক
          হতে পারে না। একটি রাস্তায় যত বাড়ি থাকে তাদের মধ্যে কোনো দুটি বাড়ির
          নাম্বার কখনো এক হতে পারে না। ঠিক তেমনি নেটওয়ার্কে যুক্ত কোন দুটো
          কমপিউটারের আইপি এ্যাড্রেস এক হতে পারে না। বাড়ির ঠিকানায় যেমন—
          রাস্তার নাম্বার এবং বাড়ির নাম্বার থাকে, IP এ্যাড্রেসেও দুটি অংশ
          নেটওয়ার্ক এ্যাড্রেস এবং হোস্ট এ্যাড্রেস থাকে। Road# 19 Network
          Address 203.91.139.3 10 KS.. XXX2 আইপি অ্যাড্রেস মূলত দুটি কাজ করে
          থাকে । যথা— ১. হোস্ট বা নেটওয়ার্ক ইন্টারফেস খুঁজে বের করে, যাতে
          ব্যবহারকারী অন্য সার্ভারের সাথে কানেক্ট হতে পারে । ২. নেটওয়ার্ক
          ব্যবহারকারী অবস্থান চিহ্নিত করে। 1st Octet ইন্টারনেট প্রোটোকল
          অ্যাড্রেসের চতুর্থ নাম্বার সংস্করণ Ipv4 এ কিছু সীমাবদ্ধতা রয়েছে। Ipv4
          এ কেবলমাত্র ৪.৩ বিলিয়ন বা ৪৩০ কোটি ওয়েব ঠিকানা বরাদ্দ করা সম্ভব।
          Ipv4 সিস্টেম যখন বানানো হয়েছিলো তখন হয়তো এটা ধারণা করা হয়নি যে
          বিশ্বে ইন্টারনেট ব্যবহারকারী এতোটা বেড়ে যাবে, বা এক এক ব্যক্তির কাছে
          ৩-৪ টা নেটওয়ার্ক ডিভাইস থাকবে। আজকের দিনে Ipv4 অ্যাড্রেস লিমিট চার
          বিলিয়ন যা একদম শেষ হয়ে গিয়েছে। এজন্যই আইপিভিড (IPv6) নামক ১২৮ বিট
          এর একটি অ্যাড্রেসিং সিস্টেম সংস্করণ তৈরি করা হয়েছে। নতুন এই
          ব্যবস্থায় ৩৪০ ট্রিলিয়ন ট্রিলিয়ন ট্রিলিয়ন ওয়েব ঠিকানা বরাদ্দ দেয়া
          সম্ভব হবে। প্রত্যেকটি মানুষের কাছে যদি কয়েক লাখ ডিভাইসও থাকে তবু এ
          ইউনিক অ্যাড্রেস ব্যবহার করে শেষ করা সম্ভব হবে না। বর্তমানে Ipv4 এর
          স্থানে IPv6 প্রতিস্থাপিত করা হচ্ছে। 172 2nd Octet 16 10101100 00010000
          3rd Octet 122 4th Octet 204 01111010 11001100 ← Binary notation Dotted
          decimal notation 172.16.122.204 চিত্র : আইপি এ্যাড্রেস ফরমেট
        </p>
      </Element>
      {/* server description */}
      <Element name="domain">
        <p className="text-white text-lg leading-relaxed text-justify max-w-5xl">
          <span className="text-teal-500">সার্ভার :</span> সার্ভার হলো
          কেন্দ্রীয়ভাবে নিয়ন্ত্রিত অপেক্ষাকৃত বেশি শক্তিশালী কম্পিউটার যেখানে
          ডেটা এবং সার্ভার সফটওয়্যার সংরক্ষিত থাকে এবং নেটওয়ার্কের মাধ্যমে যে
          অন্যান্য কম্পিউটারকে (যাকে ক্লায়েন্ট বা ওয়ার্কস্টেশন বলা হয়) ডেটা
          সার্ভিস দিয়ে থাকে। সার্বক্ষণিক ইন্টারনেটের সাথে সংযুক্ত এবং অন
          অবস্থায় থাকা এসব কম্পিউটারে বিভিন্ন ওয়েবপেজ সংরক্ষণ করা থাকে।
          সার্ভার ব্যাক-এন্ড হিসাবে কাজ করে থাকে। ক্লায়েন্ট যেসকল কম্পিউটার
          সার্ভারে সংরক্ষিত ডেটা ব্যবহার করে তাকে ক্লায়েন্ট বলা হয়। এটি
          ফ্রন্ট-এন্ড হিসাবে কাজ করে থাকে। এটি কী বোর্ড, মনিটর, মাউস ইত্যাদির
          মাধ্যমে এন্ড ইউজারের সাথে সরাসরি কাজ করে থাকে। ওয়েব সার্ভার,
          ইন্টারনেটের সাথে সংযুক্ত যে সার্ভারে ওয়েবপেজ বা ওয়েবসাইট সংরক্ষিত
          থাকে তাকে ওয়েব সার্ভার বলা হয়। ব্রাউজার প্রোগ্রামের সাহায্যে ওয়েব
          সার্ভার থেকে ওয়েবপেজ বা ওয়েবসাইটটি পর্দায় প্রদর্শিত হয়। ওয়েব
          সার্ভার HTTP প্রোটোকল ব্যবহার করে গ্রাহকের ওয়েবপেজ সরবরাহ করে। ওয়েব
          পোর্টাল : ওয়েব পোর্টাল হচ্ছে এমন একটি বিশেষ ওয়েবপেজ যেখানে অনেক উৎস
          থেকে সংগৃহীত গুরুত্বপূর্ণ তথ্য এবং লিঙ্ক সাজানো থাকে। একটি ওয়েব
          পোর্টাল সাধারণত সরকারি সেবার তথ্য, স্থানীয়, আঞ্চলিক, স্টক রিপোর্ট,
          জাতীয় খবর এবং ইমেইল সেবা প্রদান করে থাকে। ওয়েব পোর্টালে প্রথম পাতায়
          সবগুলো তথ্যের জন্য একটি ইনডেক্স বা সূচি দেয়া থাকে, যেন ব্যবহারকারীরা
          সহজে তার দরকারি তথ্য খুঁজে পায়। ওয়েব পোর্টাল বিভিন্ন ধরনের হয়ে
          থাকে। যেমন- ব্যক্তিগত, সরকারি, সাংস্কৃতিক এবং কর্পোরেট ওয়েব পোর্টাল।
          এছাড়াও আরও বিভিন্ন ধরনের ওয়েব পোর্টাল রয়েছে। বাংলাদেশের ওয়েব
          পোর্টাল ঃ http://www.bangladesh.gov.bd/ 4- IN ইন্টারনেট প্রোটোকল
          কম্পিউটার থেকে কম্পিউটারে যোগাযোগের নির্দিষ্ট নিয়মনীতিকে প্রোটোকল বলা
          হয়। কম্পিউটার থেকে কম্পিউটারে কী আদান-প্রদান হবে, কখন আদান-প্রদান
          হবে, কেমন করে আদান-প্রদান হবে, ইত্যাদি একটি প্রোটোকল নির্ধারণ করে।
          বিভিন্ন প্রতিষ্ঠান বিভিন্ন ধরনের প্রোটোকল তৈরি করেছে। যেমন- FTP (File
          Transfer Protocol), NetBUEI, AppleTalk, SMTP (Simple Mail Transfer
          Protocol), Post Office. Protocol (POP), VOIP (Voice over Internet
          Protocol), TCP/IP ইত্যাদি। এদের মধ্যে ইন্টারনেট ব্যবহৃত প্রোটোকল হচ্ছে
          TCP/IP (Transmission Control Protocol / Internet Protocol) HTTP: Hyper
          Text Transfer Protocol এর সংক্ষিপ্ত নাম হলো HTTP. এটি হলো একটি
          এপ্লিকেশন লেবেল প্রোটোকল (নিয়ম-নীতি) যা ওয়েবে সার্ভার এবং ক্লায়েন্ট
          কম্পিউটারের মধ্যে ডেটা আদান-প্রদান করে থাকে। HTTP হচ্ছে ইন্টারনেটে
          তথ্য আদান-প্রদানের একটি জনপ্রিয় ও বহুল প্রচলিত পদ্ধতি। একজন
          ক্লায়েন্ট (ব্রাউজার) সার্ভারে একটি রিকুয়েস্ট সাবমিট করলে, সার্ভার
          ক্লায়েন্টের রিকুয়েস্টের উপর HTTP এর কাজ : • সার্ভারের সাথে
          ব্রাউজারের (ক্লায়েন্টের) যোগাযোগ করে। ব্রাউজারের যেকোনো অনুরোধ
          সার্ভারে পৌঁছে দেয়। • সার্ভার থেকে প্রয়োজনীয় তথ্য, পৃষ্ঠা, ছবি,
          ইমেজ ব্রাউজারে নিয়ে আসে। ডোমেইন নেম (Domain Name) আইপি এ্যাড্রেস
          নাম্বার দ্বারা লিখিত হয়। আইপি এ্যাড্রেসের জন্য সংখ্যা মনে রাখা
          কষ্টকর। আইপি এ্যাড্রেসকে সহজে ব্যবহারযোগ্য করার জন্য ইংরেজি অক্ষরের
          কোন নাম ব্যবহার করা হয়। ক্যারেক্টার ফর্মের দেয়া কম্পিউটারের এরূপ
          নামকে ডোমেইন নেম বলা হয়। যেমন, আইপি এ্যাড্রেস 173.248.140.183 এর
          পরিবর্তে www.school.com ডোমেইন নেম ব্যবহার করা যায়। ডোমেইন নেমকে
          কঠোরভাবে নিয়ন্ত্রণ করা হয়, যাতে করে একই নাম অন্য কেউ না পায়। যে
          পদ্ধতিতে ডোমেইন নেমকে নিয়ন্ত্রণ করা হয় তাকে DNS (Domain Naming
          System) বলে। এখানে school.com ডোমেইন নেম-এ দুটি অংশ দেখা যাচ্ছে।
          ডোমেইন নেমের ডট এর পরের অংশটিকে টপ লেভেল ডোমেইন বলা হয়। এটি দেখে
          সহজেই বুঝা যায় প্রতিষ্ঠানটি কোন ধরনের। টপ লেবেল ডোমেইনসমূহকে আবার
          জেনেরিক এবং কান্ট্রি এ দুটি বৃহৎ ভাগে ভাগ করা হয়েছে। নিচের টেবিলে সাত
          ধরনের জেনেরিক টপ লেভেল ডোমেইন দেখানো হলো । ডোমেইন প্রকৃতি উদাহরণ
        </p>
      </Element>
      {/* url description */}
      <Element name="url">
        <p className="text-white text-lg leading-relaxed text-justify max-w-5xl">
          <span className="text-teal-500">ইউআরএল (URL)</span>
          <br />
          কোন ওয়েবপেজকে প্রদর্শন করতে ওয়েব ব্রাউজারে এর ঠিকানা নির্দিষ্ট করে
          দিতে হয়। URL (Uniform/ Universal Resource Locator) হলো ওয়েবসাইটের
          একক (Unique) ঠিকানা । প্রতিটি URL-এ থাকে-
          <br />
          ১. ওয়েব প্রোটোকল (Web Protocol)
          <br />
          ২. ওয়েব সার্ভারের নাম (Web Server name / Domain name) / Host
          name/Computer name
          <br />
          ৩. সার্ভারের ডিরেক্টরি/ফোল্ডার নেম (Server Directory / Folder
          name)/Directory Path <br />
          ৪. html ফাইল নেম ( html file name) /Document name
          <br />
          ওয়েব ডিজাইন পরিচিতি এবং HTML নিচে একটি ইউআরএল এর বর্ণনা দেয়া হলো—
          প্রোটোকল ওয়েব সার্ভারের নাম (ডোমেইন নেম) ডিরেক্টরি নাম (পাথ) ফাইল এবং
          এক্সটেনশন
          <br />
          http://www.school.com/home/result
          <br />
          ওয়েব প্রোটোকল : http (hyphertext transfer protocol) ওয়েব প্রোটোকল
          হলো তথ্য বিনিময়ের যোগাযোগের নিয়ম যা ওয়েব ব্রাউজারকে ওয়েব সার্ভারের
          সাথে যোগাযোগ করার অনুমতি দেয়। সাধারণত প্রায় সব ওয়েব এ্যাড্রেসই শুরু
          হয় http:// দিয়ে । তাই ওয়েব এ্যাড্রেসে এ অংশটি লিখা হয় না। www অংশ
          দিয়েই শুরু করা হয়। : (কোলন) URL প্রোটোকল অংশকে ওয়েব অ্যাড্রেসের
          অংশগুলোকে আলাদা করতে ব্যবহৃত হয় এবং // (ডাবল স্ল্যাস) সার্ভারের সাথে
          যোগাযোগের বিষয়কে নির্দেশ করে।
        </p>
      </Element>
      {/* ip ,domain,url disparity table */}
      <Element name="ip-domain-url-disparity">
        <p className="text-white text-lg leading-relaxed text-justify max-w-5xl">
          <div className="w-[35%] sm:w-[65%] md:w-[90%] overflow-x-auto   mx-auto">
          <div className="overflow-x-auto">
  <table className="min-w-full border-collapse table-auto">
    <thead>
      <tr className="bg-gray-100 text-amber-600">
        <th className="border border-gray-400 px-4 py-2">বিবরণ</th>
        <th className="border border-gray-400 px-4 py-2">আইপি অ্যাড্রেস (IP Address)</th>
        <th className="border border-gray-400 px-4 py-2">ইউআরএল (URL)</th>
        <th className="border border-gray-400 px-4 py-2">ডোমেইন নেম (Domain Name)</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td className="border border-gray-400 px-4 py-2">পূর্ণরূপ</td>
        <td className="border border-gray-400 px-4 py-2">ইন্টারনেট প্রোটোকল অ্যাড্রেস</td>
        <td className="border border-gray-400 px-4 py-2">ইউনিফর্ম রিসোর্স লোকেটর</td>
        <td className="border border-gray-400 px-4 py-2">-</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">বর্ণনা</td>
        <td className="border border-gray-400 px-4 py-2">ইন্টারনেটে যুক্ত প্রতিটি কম্পিউটারের একটি ঠিকানা।</td>
        <td className="border border-gray-400 px-4 py-2">নির্দিষ্ট রিসোর্সের সমন্বিত রূপ।</td>
        <td className="border border-gray-400 px-4 py-2">আইপি এ্যাড্রেসকে সহজে ব্যবহারযোগ্য করার জন্য ইংরেজি অক্ষরের নাম।</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">ফরম্যাট</td>
        <td className="border border-gray-400 px-4 py-2">সংখ্যাসূচক (যেমন: 123.45.225.1, 173.248.140.183)</td>
        <td className="border border-gray-400 px-4 py-2">বর্ণ-সংখ্যাসূচক এবং চিহ্ন (যেমন: http://www.gmu.edu/department/ict/sp.html)</td>
        <td className="border border-gray-400 px-4 py-2">বর্ণ-সংখ্যাসূচক (যেমন: www.school.com)</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">মনে রাখা</td>
        <td className="border border-gray-400 px-4 py-2">মনে রাখা কঠিন</td>
        <td className="border border-gray-400 px-4 py-2">আইপি এ্যাড্রেসের তুলনায় সহজ</td>
        <td className="border border-gray-400 px-4 py-2">মনে রাখা সহজ</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">নিয়ন্ত্রণ</td>
        <td className="border border-gray-400 px-4 py-2">IANA কর্তৃক নিয়ন্ত্রিত</td>
        <td className="border border-gray-400 px-4 py-2">-</td>
        <td className="border border-gray-400 px-4 py-2">ICANN কর্তৃক নিয়ন্ত্রিত</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">প্রকৃতি</td>
        <td className="border border-gray-400 px-4 py-2">কম্পিউটার-বান্ধব</td>
        <td className="border border-gray-400 px-4 py-2">-</td>
        <td className="border border-gray-400 px-4 py-2">মানুষ-বান্ধব</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">ব্যবহার</td>
        <td className="border border-gray-400 px-4 py-2">ডেটা স্থানান্তরের জন্য ব্যবহৃত</td>
        <td className="border border-gray-400 px-4 py-2">-</td>
        <td className="border border-gray-400 px-4 py-2">আইপি এ্যাড্রেসকে শনাক্ত করার জন্য ব্যবহৃত</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">DNS সার্ভারের প্রয়োজন</td>
        <td className="border border-gray-400 px-4 py-2">প্রয়োজন নেই</td>
        <td className="border border-gray-400 px-4 py-2">প্রয়োজন আছে</td>
        <td className="border border-gray-400 px-4 py-2">-</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">সংখ্যা সীমাবদ্ধতা</td>
        <td className="border border-gray-400 px-4 py-2">সীমিত</td>
        <td className="border border-gray-400 px-4 py-2">সীমাহীন</td>
        <td className="border border-gray-400 px-4 py-2">-</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">উদাহরণ</td>
        <td className="border border-gray-400 px-4 py-2">123.45.225.1, 173.248.140.183</td>
        <td className="border border-gray-400 px-4 py-2">http://www.gmu.edu/department/ict/sp.html</td>
        <td className="border border-gray-400 px-4 py-2">www.school.com</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">শনাক্তকরণ</td>
        <td className="border border-gray-400 px-4 py-2">ইন্টারনেট অবস্থান শনাক্ত করে</td>
        <td className="border border-gray-400 px-4 py-2">-</td>
        <td className="border border-gray-400 px-4 py-2">আইপি এ্যাড্রেসকে শনাক্ত করে</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">ব্রাউজার বোঝে</td>
        <td className="border border-gray-400 px-4 py-2">ব্রাউজার সরাসরি বুঝতে পারে</td>
        <td className="border border-gray-400 px-4 py-2">-</td>
        <td className="border border-gray-400 px-4 py-2">ব্রাউজার সরাসরি বুঝতে পারে না; আইপি এ্যাড্রেসে কনভার্ট করে</td>
      </tr>
    </tbody>
  </table>
</div>

          </div>
        </p>
      </Element>
      {/* web browser */}
      <Element name="browser">
        <p className="text-white text-lg leading-relaxed text-justify max-w-5xl">
          <span className="text-teal-500">ওয়েব ব্রাউজার ( Web Browser )</span>{" "}
          <br />
          <br />
          ওয়েব ব্রাউজার হলো ওয়ার্ল্ড ওয়াইড ওয়েব রিসোর্স থেকে তথ্য খুঁজে বের
          করা, একসিস করা এবং উপস্থাপন করার একটি এ্যাপ্লিকেশন সফটওয়্যার। ওয়েব
          ব্রাউজার দ্বারা উপস্থাপিত পেজের হাইপারলিংকে ক্লিক করে সম্পর্কিত
          অন্যান্য তথ্য প্রদর্শন করা যায়। ওয়েব ব্রাউজারের মাধ্যমে ওয়ার্ল্ড
          ওয়াইড ওয়েবে একসেস করা ছাড়াও প্রাইভেট নেটওয়ার্কের ওয়েব সার্ভারেও
          একসেস করা যায়। ওয়েব সার্ভারে রাখা ওয়েবপেজ (Webpage) বা www পরিদর্শন
          করাকে ওয়েব ব্রাউজিং (Web browsing) বলা হয়। <br />
          <br />
          বেশি প্রচলিত ওয়েব ব্রাউজারসমূহ হলো- ইন্টারনেট এক্সপ্লোরার (Internet
          Explorer), ফায়ারফক্স (Firefox), গুগল ক্রোম (Google Chrome), সাফারি
          (Safari ) এবং ওপেরা (Opera) ইত্যাদি।
          <br />
          <br />
          ব্রাউজার কীভাবে কাজ করে?
          <br />
          ওয়েবসাইট দেখার জন্য আমরা কোনো ব্রাউজার প্রোগ্রাম চালু করে এর
          এ্যাড্রেসবারে ওয়েবসাইটটির URL অর্থাৎ ঠিকানা টাইপ করে থাকি।
          ওয়েবসাইটটির পুরো ঠিকানা টাইপ না করে এর ডোমেইন নেম টাইপ করলেও
          ওয়েবসাইটটি প্রদর্শিত হয়। ইন্টারনেটের গতি অনুযায়ী অতি দ্রুত
          ওয়েবসাইটটি প্রদর্শিত হয়। এক্ষেত্রে ওয়েব ব্রাউজারটি যেভাবে কাজ করে :
          <br /> ১. অপারেটিং সফটওয়্যার (ওএস), কম্পিউটারের সাথে এমবেডেড
          সফটওয়্যার ডিএনএস রিসলভারকে ডোমেইন নেমটি প্রদান করে। রিসলভার ডোমেইন
          নেমটিকে আইপি এ্যাড্রেসে ট্রান্সলেট করে থাকে। এ কাজটি করার জন্য রিসলভার
          ডোমেইন নেমটি গ্রহণ করে রুট সার্ভারকে প্রদান করে। <br />
          ২. রুট সার্ভার ডোমেইন নেমটি দেখে এর এক্সটেনশন অর্থাৎ টপ লেবেল ডোমেইন
          অনুযায়ী এ সম্পর্কিত টিএলডি নেম সার্ভারে পাঠায়।
          <br />
          ৩. টিএলডি নেম সার্ভার উক্ত ডোমেইন নেমটিকে অথোরেটিভ নেম সার্ভারে
          পাঠায়।
          <br />
          ৪. অথোরেটিভ নেম সার্ভারে সংরক্ষিত উক্ত ডোমেইন নেম এর আইপি অ্যাড্রেসটি
          প্রদান করে। রিসলভার উক্ত আইপি অ্যাড্রেসটি ব্রাউজারকে প্রদান করে।
          ব্রাউজার তখন আইপি অ্যাড্রেসটি পেয়ে সে আইপি অ্যাড্রেসের সার্ভারটিতে
          ঢুকে ওয়েবপেজটি প্রদর্শন করে।
          <br />
          ব্রাউজার রন্ট সার্ভার টিএলডি সার্ভার অথোরেটিভ নেম সার্ভার ওয়েবসাইট
          ব্রাউজারে ডোমেইন নেম টাইপ করে দ্রুত ওয়েবসাইট প্রদর্শিত হয় বিধায়
          মাঝখানে অনেকগুলো ধাপে কাজ করলেও আমরা বুঝতে পারি না। সহসা প্রদর্শিত
          বিভিন্ন ওয়েবসাইটের আইপি অ্যাড্রেস রিসলভার তার মেমোরিতে সেভ করে রাখে
          বিধায় ওয়েবসাইটটি পরবর্তীতে খুঁজে পেতে বিভিন্ন সার্ভারকে রিকোয়েস্ট
          না করে সরাসরি তা ব্রাউজারকে প্রদান করে বিধায় সাইটটি দ্রুত প্রদর্শিত
          হয়। ওয়েবপেজে টেক্সট, ভিডিও, অডিও, এনিমেশন, ইমেজসহ সকল সাধারণ
          মাল্টিমিডিয়াসহ বর্তমান ওয়েবপেজগুলোতে ভার্চুয়াল রিয়েলিটির মাধ্যমে
          ত্রিমাত্রিক ও উচ্চ পর্যায়ের ইন্টারঅ্যাকটিভিটিও যুক্ত করা সম্ভব হচ্ছে।
        </p>
      </Element>
      {/* search engine */}
      <Element name="search">
        <p className="text-white text-lg leading-relaxed text-justify max-w-5xl">
          <span className="text-teal-500">সার্চ ইঞ্জিন (Search Engine)</span>
          <br />
          <br />
          ইন্টারনেটের অজস্র ওয়েব সার্ভার থেকে সহজেই যেকোন তথ্য খুঁজে বের করার
          টুলকে সার্চ ইঞ্জিন বলা হয়। বহুলভাবে ব্যবহৃত হচ্ছে এমন জনপ্রিয় সার্চ
          ইঞ্জিন হচ্ছে গুগল, ইয়াহু, আলটাভিসতা ইত্যাদি । বিশ্বখ্যাত সার্চ ইঞ্জিন
          গুগলের জনক হলেন ল্যারি পেজ (Larry Page) এবং সের্গেই ব্রিন (Sergey
          Brin)। এককালের জনপ্রিয় সার্চ ইঞ্জিন ইয়াহু এর জনক ছিলেন জেরি ইয়াং ও
          ডেভিড ফেলো । পিপীলিকা হলো বাংলাদেশে তৈরিকৃত প্রথম সার্চ ইঞ্জিন।
          <br />
          সার্চ ইঞ্জিন কীভাবে কাজ করে?
          <br />
          সার্চ ইঞ্জিনগুলো বিভিন্ন অ্যালগরিদমের মাধ্যমে কাজ করে। রিয়েল টাইম
          তথ্য বজায় রাখতে সার্চ ইঞ্জিনগুলো মূলত তিনটি পর্যায় বা ধাপকে অনুসরণ
          করে। এগুলো হলো- ১. ওয়েব ক্রলিং ২. ইনডেক্সিং এবং ৩.
          রিট্রাইভাল/সার্চিং।
          <br />
          <span className="text-teal-500">ওয়েব ক্রলিং (Web Crawling)</span>
          <br />
          <br />
          সার্চ ইঞ্জিনে তথ্য খুঁজে পাওয়ার কাজটি করার জন্য সার্চ ইঞ্জিনগুলো
          বিশেষায়িত সফটওয়্যার রোবট তৈরি করে। এদেরকে বলা হয় 'স্পাইডার'। পুরো
          ওয়েবে ঘুরে বেড়ানো আর সবকিছু লিপিবদ্ধ করাই এদের কাজ। এই প্রক্রিয়াকেই
          বলা হয় ওয়েব ক্রলিং। সার্চ ইঞ্জিনগুলো ওয়েব ক্রলিংয়ের মাধ্যমে
          বিভিন্ন ওয়েবসাইটের তথ্য পেয়ে থাকে। ওয়েব স্পাইডারের মাধ্যমে
          ওয়েবসাইটের বিভিন্ন ফাইল ও তথ্য পর্যবেক্ষণ করা হয় যেটি একটি
          স্বয়ংক্রিয় বট (Bot)।
          <br />
          <span className="text-teal-500">ইনডেক্সিং (Indexing)</span>
          <br />
          <br />
          ক্রাউল হতে প্রাপ্ত সমস্ত ধরনের ডেটাকে গ্রহণ করে সেগুলোকে বৃহদাকার
          ডেটাবেসে স্থাপনের প্রক্রিয়াটিই হলো ইনডেক্সিং। প্রাপ্ত তথ্যসমূহ হতে
          একটি সর্বজনীন ডেটাবেস তৈরি করা হয় যা ওয়েব সার্চ ইঞ্জিনগুলোকে
          প্রয়োজনীয় তথ্য প্রদান করে ।<br />
          <span className="text-teal-500">
            রিট্রাইভান/সার্চিং (Retrieval / Searching)
          </span>
          <br />
          <br />
          ব্যবহারকারী কোনো সার্চ ইঞ্জিনে প্রবেশ করে কোনো কীওয়ার্ড সার্চ করলে
          সার্চ ইঞ্জিন অতি দ্রুত সেই কীওয়ার্ড সম্পর্কিত ইনডেক্সকৃত ডেটা প্রসেস
          করে এবং সার্চ ইঞ্জিন রেজাল্ট পেজে ওয়েবসাইটের লিংকগুলোকে প্রেরণ করে।
          ইনডেক্সিংয়ের সময় সার্চ ইঞ্জিন সার্চ ফলাফলের জন্য একই কীওয়ার্ড
          সম্পর্কিত সাইটগুলোর পৃথক তালিকা তৈরি করে।
        </p>
      </Element>
      {/* classification of website */}
      <Element name="classification">
        <p className="text-white text-lg leading-relaxed text-justify max-w-5xl">
          <span className="text-2xl text-teal-500">
            ওয়েবসাইটের প্রকারভেদ (Types of Website)
          </span>
          <br />
          <br />
          গঠন বৈচিত্র্যের উপর ভিত্তি করে পেজ বা ওয়েবসাইটকে সাধারণত দুই ভাগে ভাগ
          করা হয়। যথা— <br />
          ১. স্ট্যাটিক ওয়েবপেজ বা স্ট্যাটিক ওয়েবসাইট (Static Webpage or Static
          Website)
          <br />
          ২. ডাইনামিক ওয়েবপেজ বা ডাইনামিক ওয়েবসাইট (Daynamic Webpage or
          Dynamic Website) <br />
          <br />
          <span className="text-2xl text-teal-500">
            স্ট্যাটিক ওয়েবসাইট (Static Website)
          </span>{" "}
          <br />
          যে সকল ওয়েবপেজে পূর্ব থেকে তৈরিকৃত কিছু তথ্য প্রদর্শন করে থাকে সে সকল
          ওয়েবপেজকে স্ট্যাটিক ওয়েবপেজ বলে। স্ট্যাটিক ওয়েবসাইটের ডেটার মান
          ওয়েবপেজ লোডিং বা চালু করার পর পরিবর্তন করা যায় না। সাধারণত HTML ভাষা
          ব্যবহার করে স্ট্যাটিক ওয়েবপেজ তৈরি করা হয়। স্ট্যাটিক ওয়েব পেইজের
          ফাইলের নামের বর্ধিতাংশ "htm” অথবা “html”।
          <br />
          স্ট্যাটিক ওয়েবসাইটের সুবিধা/বৈশিষ্ট্যসমূহ
          <br />
          ১. পেজগুলোতে কনটেন্ট নির্দিষ্ট থাকে ।<br />
          ২. দ্রুত লোডিং হয়।
          <br />
          ৩. উন্নয়ন ও নিয়ন্ত্রণ করা সহজ।
          <br />
          ৪. সাধারণত কোন ডেটাবেজ সংযোগ থাকে না।
          <br />
          ৫. HTML এবং CSS ভাষা ব্যবহার করে উন্নয়ন করা যায়।
          <br />
          ৬. রক্ষণাবেক্ষণ ও উন্নয়ন খরচ কম।
          <br />
          ৭. তুলনামূলকভাবে বেশি নিরাপদ।
          <br />
          স্ট্যাটিক ওয়েবসাইটের অসুবিধাসমূহ
          <br />
          ১. রান টাইমে কনটেন্ট আপডেট করা যায় না। <br />
          ২. কনটেন্ট আপডেট করতে বেশি সময় লাগে।
          <br />
          ৩. আপডেট করে পুনরায় আপলোড করতে হয়।
          <br />
          ৪. ব্যবহারকারী থেকে ইনপুট নেয়া যায় না।
          <br />
          ৫. আকার বৃদ্ধি পেলে কনটেন্টগুলো নিয়ন্ত্রণ করা কঠিন হয়ে পড়ে <br />
          ৬. মানসম্মত ওয়েবপেজ ডিজাইনিং করা কঠিন।
          <br />
          <br />
          <span className="text-2xl text-teal-500">
            ডাইনামিক ওয়েবসাইট (Dynamic Website){" "}
          </span>
          <br />
          যে সকল ওয়েবপেজে আপডেট তথ্য প্রদর্শন করে অর্থাৎ পরিবর্তিত তথ্য
          প্রদর্শন করে সে সকল ওয়েবপেজকে ডাইনামিক ওয়েবপেজ বলা হয়। ডাইনামিক
          ওয়েবসাইটের ডেটার মান ওয়েবপেজ লোডিং বা চালু করার পর পরিবর্তন করা
          যায়। এ ওয়েবসাইটের সাথে ডেটাবেজ যুক্ত থাকে। যেমন- ক্রিকেট লাইভ স্কোর।
          সাধারণত PHP, ASP, JSP ভাষা ব্যবহার করে ডাইনামিক ওয়েবপেজ তৈরি করা হয়।
          ডাইনামিক ওয়েবপেজের ফাইলের নামের বর্ধিতাংশ PHP, ASP, JSP । ডাইনামিক
          ওয়েবসাইটে ব্যবহারকারীদের নিকট হতে ইনপুট দেয়ার ব্যবস্থা থাকে।
          বর্তমানে এ ধরনের ওয়েবসাইটের চাহিদা সবচেয়ে বেশি।
          <br />
          ডাইনামিক ওয়েবসাইটের সুবিধা/বৈশিষ্ট্যসমূহ
          <br />
          ১ রান টাইমে কনটেন্ট আপডেট করা যায়।
          <br />
          ২. ব্যবহারকারী থেকে ইনপুট নেয়া যায় ।<br />
          ৩. আপডেট করে পুনরায় আপলোড করতে হয় না।
          <br />
          ৪. আকার বৃদ্ধি পেলে কনটেন্টগুলো নিয়ন্ত্রণ করা কঠিন নয়।
          <br />
          ৫. মানসম্মত ওয়েবপেজ ডিজাইনিং করা সহজ।
          <br />
          ৬. ডেটাবেজ ব্যবহার করায় কুয়েরি করে তথ্য বের করা যায়।
          <br />
          ৭. ই-কমার্স সুবিধা বেশি।
          <br />
          ডাইনামিক ওয়েবসাইটের অসুবিধাসমূহ
          <br />
          ১. ডেটাবেজ ব্যবহৃত হওয়ায় লোডিং হতে সময় বেশি লাগে।
          <br />
          ২. উন্নয়ন ও নিয়ন্ত্রণ করা তুলনামূলক জটিল ।<br />
          ৩. দক্ষ জনবল প্রয়োজন।
          <br />
          ৪. খরচ বেশি।
          <br />
          ৫. ছোট প্রতিষ্ঠানের জন্য অপ্রয়োজনীয়
          <br />
          ৬. তুলনামূলকভাবে প্রশিক্ষণ কঠিন।
          <br />
          <span className="text-2xl text-teal-500">লোকাল ওয়েবপেজ :</span> যে
          সকল ওয়েবপেজ সাধারণত নিজস্ব কম্পিউটার বা সার্ভারে সংরক্ষণ করা হয় এবং
          সোর্স ড্রাইভ ও ডিরেক্টরি থেকে সহজেই ব্যবহার করা যায় সেগুলোকে লোকাল
          ওয়েবপেজ বলা হয়। এ ধরনের ওয়েবপেজ ব্যবহারের জন্য ইন্টারনেট সংযোগের
          প্রয়োজন হয় না।
          <br />
          <span className="text-2xl text-teal-500">রিমোট ওয়েবপেজ :</span>{" "}
          দূরবর্তী কোন কম্পিউটারে/ওয়েব সার্ভারে সংরক্ষিত ওয়েবপেজগুলোকে রিমোট
          ওয়েবপেজ বলা হয়। রিমোট ওয়েবপেজ ডাউনলোড করার জন্য ইন্টারনেট সংযোগের
          প্রয়োজন হয়। এ ধরনের ওয়েবপেজ ব্রাউজিং-এর জন্য ওয়েব অ্যাড্রেস জানার
          প্রয়োজন হয়। এরূপ অ্যাড্রেসকে URL (Universal Resource Locator) বলা
          হয় ।
        </p>
      </Element>
      {/* statice and dynamic website disparity */}
      <Element name="static-dynamic-disparity">
        <p className="text-white text-xl leading-relaxed text-justify max-w-5xl">
          <div className="overflow-x-auto w-[70%] sm:w-[80%] mx-auto p-4">
          <div className="overflow-x-auto">
  <table className="min-w-full table-auto border-collapse border border-gray-400 w-full">
    <thead>
      <tr className=" text-amber-500">
        <th className="border border-gray-400 px-4 py-2">বিবরণ</th>
        <th className="border border-gray-400 px-4 py-2">স্ট্যাটিক ওয়েবসাইট (Static Websites)</th>
        <th className="border border-gray-400 px-4 py-2">ডাইনামিক ওয়েবসাইট (Dynamic Websites)</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td className="border border-gray-400 px-4 py-2">পেজ সংখ্যা</td>
        <td className="border border-gray-400 px-4 py-2">নির্দিষ্ট সংখ্যক পেজ থাকে</td>
        <td className="border border-gray-400 px-4 py-2">ডাইনামিকভাবে পেজ তৈরি হয়</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">থিম এবং কন্টেন্ট</td>
        <td className="border border-gray-400 px-4 py-2">ওয়েবসাইটের থিম এবং ওয়েবপেজের কন্টেন্ট নির্দিষ্ট</td>
        <td className="border border-gray-400 px-4 py-2">ওয়েবপেজ ডিজাইন এবং কন্টেন্ট রান টাইমে পরিবর্তিত হয়</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">লোড সময়</td>
        <td className="border border-gray-400 px-4 py-2">কয়েকটি মাত্র মার্কআপ কন্টেন্ট থাকায় দ্রুত লোড হয়</td>
        <td className="border border-gray-400 px-4 py-2">ডাইনামিকভাবে কন্টেন্ট তৈরি হওয়ার জন্য লোড হতে দেরি হয়</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">ডেটাবেজ কানেক্টিভিটি</td>
        <td className="border border-gray-400 px-4 py-2">কখনো ডেটাবেজ কানেক্টিভিটি ব্যবহার করে না</td>
        <td className="border border-gray-400 px-4 py-2">ডেটাবেজ কানেক্টিভিটি ব্যবহার করে</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">নিরাপত্তা</td>
        <td className="border border-gray-400 px-4 py-2">তুলনামূলকভাবে বেশি নিরাপদ</td>
        <td className="border border-gray-400 px-4 py-2">তুলনামূলকভাবে কম নিরাপদ</td>
      </tr>
      <tr>
        <td className="border border-gray-400 px-4 py-2">ব্যবহার</td>
        <td className="border border-gray-400 px-4 py-2">কোন সংগঠন বা প্রতিষ্ঠানের তথ্য প্রদর্শন করে</td>
        <td className="border border-gray-400 px-4 py-2">এখানে রান টাইমে কন্টেন্ট পরিবর্তন হয় যেমন ই-কমার্স, অনলাইন এক্সাম ইত্যাদি ওয়েবসাইটের তথ্য প্রদর্শন করে</td>
      </tr>
    </tbody>
  </table>
</div>

          </div>
        </p>
      </Element>
      <Element name="structure">
        <WebsiteStructure />
      </Element>
      <Element name="html-concept">
        <HTMLStructure />
      </Element>
      <Element name="syntax">
        <HTMLElementsAndSyntax />
      </Element>
      <Element name="layout">
        <HTMLPageLayout />
      </Element>
      <Element name="tagSyntax">
        <HTMLTags />
      </Element>

      <Element name="text_format">
        <HTMLTextFormatting />
      </Element>
      <Element name="hyperlink">
        <HTMLHyperlink />
      </Element>
      <Element name="image_adding">
        <HTMLImage />
      </Element>
      <Element name="list">
        <HTMLLists />
      </Element>
      <Element name="table">
        <HTMLTable />
      </Element>
    </div>
  );
};

export default IctHeader;
