import React from 'react';

const GitConfigure = () => {
  return (
    <div className="w-full max-w-5xl mx-auto p-4 text-white rounded-md bg-gray-800">
      <h1 className="text-lg sm:text-xl md:text-2xl text-teal-500 font-bold mb-4">গিট কনফিগার</h1>
      <div className="border border-gray-400 p-4 rounded-lg">
        <p className="mb-4">
          গিটের গ্লোবাল কিছু কনফিগারেশন করে নিতে হবে সবকিছু শুরু করার আগে। খুবই সিম্পল। জাস্ট আপনার কমান্ড লাইনটা ওপেন করে নিচের কমান্ডগুলো নিজে নাম এবং ইমেইল দিয়ে সেটাপ করে নিন।
        </p>
        <p className="mb-4">
          নিচের কমান্ডগুলো গিট এর গ্লোবাল কনফিগারেশন। অর্থাৎ আপনার সিস্টেমে যত প্রোজেক্টে গিট ব্যবহার করবেন তার সবগুলোতে ইউজারের নাম আর ইমেইল হিসেবে এগুলোই ব্যবহার হবে।
        </p>
        <div className="bg-gray-700 p-2 rounded mb-4">
          <code className="block text-green-400">&gt; git config --global user.name "Your User Name"</code>
          <code className="block text-green-400">&gt; git config --global user.email "Your Email"</code>
        </div>
        <p className="mb-4">
          ঠিক এভাবেই আপনি আপনার নাম আর আপনার ইমেইল দেবেন এখানে। ব্যাস কাজ কমপ্লিট।
        </p>
        <p className="mb-4">
          কিন্তু আপনি যদি চান একাধিক প্রোজেক্টের জন্য একাধিক নাম ও ইমেইল থাকবে তাহলে <code className="text-green-400">global</code> কীওয়ার্ড ও তার আগের হাইফেন দুটো কেটে দিন। যেমন আপনার পিসিতে অফিসের একটা প্রোজেক্ট আছে আবার আপনার পার্সোনাল একটা প্রোজেক্ট আছে। অফিসের প্রোজেক্টটি রাখা আছে গিটহাবের আপনার অফিসের অ্যাকাউন্টে। আপনি সেই অ্যাকাউন্টে অ্যাক্সেস করেন আপনার অফিসের ইমেইল দিয়ে। আর আপনার পার্সোনাল গিটহাব অ্যাকাউন্ট খোলা হয়েছিল আপনার পার্সোনাল ইমেইল দিয়ে। তাহলে আপনার প্রোজেক্টে যদি গ্লোবাল ইউজার নাম আর ইমেইল সেট করা থাকে তখন কিন্তু সব প্রোজেক্টেই আপনার একই নাম ও একই ইমেইল দেখাবে।
        </p>
        <p className="mb-4">
          এজন্য গ্লোবাল ইউজারনেম, ইমেইলের পাশাপাশি কোন প্রোজেক্টে অন্য কোন ইউজারনেম, ইমেইল ব্যবহার করতে চাইলে উক্ত প্রোজেক্টে গিট ইনিশিয়ালাইজ করার পর এভাবে কমান্ড ব্যবহার করে শুধুমাত্র সেই প্রোজেক্টের জন্য ইউজারনেম ও ইমেইল সেটআপ করতে পারবেন:
        </p>
        <div className="bg-gray-700 p-2 rounded mb-4">
          <code className="block text-green-400">&gt; git config user.name "Your User Name"</code>
          <code className="block text-green-400">&gt; git config user.email "Your Email"</code>
        </div>
        <p className="mb-4">
          গিট ডিরেক্টরিরেকই বেসিক্যালি রিপোজিটরি (Repository) বা শর্টকাটে অনেকেই 'রিপো (Repo)' বলে। আপনার অলরেডি প্রোজেক্ট আছে এমন কোনো প্রোজেক্টে গিট স্টার্ট করতে চাইলে প্রথমে আপনার গিট ব্যাশ বা আপনার যেকোনো কমান্ড লাইন থেকে সে প্রোজেক্টের ডিরেক্টরিতে যেতে হবে। সে ক্ষেত্রে আপনি যদি গিটের সেটআপের সময় কোনো অপশন পরিবর্তন করে না থাকেন তাহলে আপনার প্রোজেক্টের ভিতরে রাইট ক্লিক করলে দেখবেন 'Git Bash Here' (বিশেষ করে Windows অপারেটিং সিস্টেমে) নামে একটা অপশন দেখাবে। এতে আপনার কাঙ্ক্ষিত প্রোজেক্ট ডিরেক্টরির ভিতর থেকে ক্লিক করলে এই ডিরেক্টরিতে গিট ব্যাশ ওপেন হবে যেখানে আপনি কমান্ড লিখতে পারবেন।
        </p>
      </div>
    </div>
  );
};

export default GitConfigure;
